Table of Contents
 Class BimApiApplication
Namespace
IdeaStatiCa.BimApiLink
Assembly
IdeaStatiCa.BimApiLink.dll
public abstract class BimApiApplication : ApplicationBIM, IApplicationBIM
Inheritance
object
ApplicationBIM
BimApiApplication
Implements
IApplicationBIM
Derived
CadApplication
FeaApplication
Inherited Members
 ApplicationBIM.IdeaStaticaApp
 ApplicationBIM.Progress
 ApplicationBIM.GetActiveSelection()
 ApplicationBIM.Id
 ApplicationBIM.GetActiveSelectionModel(CountryCode, RequestedItemsType)
 ApplicationBIM.GetActiveSelectionModelXML(CountryCode, RequestedItemsType)
 ApplicationBIM.GetActiveSelectionModelXMLAsync(CountryCode, RequestedItemsType)
 ApplicationBIM.GetApplicationName()
 ApplicationBIM.GetModelForSelection(CountryCode, List<BIMItemsGroup>)
 ApplicationBIM.GetModelForSelectionXML(CountryCode, List<BIMItemsGroup>)
 ApplicationBIM.GetModelForSelectionXMLAsync(CountryCode, List<BIMItemsGroup>)
 ApplicationBIM.IsCAD()
 ApplicationBIM.SelectAsync(List<BIMItemId>)
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 BimApiApplication(string, IPluginLogger, IProject, IProjectStorage, IBimApiImporter, IPluginHook, IScopeHook, IBimUserDataSource, TaskScheduler)
protected BimApiApplication(string applicationName, IPluginLogger logger, IProject project, IProjectStorage projectStorage, IBimApiImporter bimApiImporter, IPluginHook pluginHook, IScopeHook scopeHook, IBimUserDataSource userDataSource, TaskScheduler taskScheduler)
Parameters
applicationName string
logger IPluginLogger
project IProject
projectStorage IProjectStorage
bimApiImporter IBimApiImporter
pluginHook IPluginHook
scopeHook IScopeHook
userDataSource IBimUserDataSource
taskScheduler TaskScheduler
Properties
 ApplicationName
protected override string ApplicationName { get; }
Property Value
string
Methods
 ActivateInBIM(List<BIMItemId>)
public override void ActivateInBIM(List<BIMItemId> items)
Parameters
items List<BIMItemId>
 ActivateMethod(List<BIMItemId>)
protected virtual void ActivateMethod(List<BIMItemId> items)
Parameters
items List<BIMItemId>
 CreateScope(CountryCode)
protected BimLinkScope CreateScope(CountryCode countryCode)
Parameters
countryCode CountryCode
Returns
BimLinkScope
 ImportActive(CountryCode, RequestedItemsType)
protected override ModelBIM ImportActive(CountryCode countryCode, RequestedItemsType requestedType)
Parameters
countryCode CountryCode
requestedType RequestedItemsType
Returns
ModelBIM
 ImportSelection(CountryCode, RequestedItemsType)
protected abstract ModelBIM ImportSelection(CountryCode countryCode, RequestedItemsType requestedType)
Parameters
countryCode CountryCode
requestedType RequestedItemsType
Returns
ModelBIM
 ImportSelection(CountryCode, List<BIMItemsGroup>)
protected override List<ModelBIM> ImportSelection(CountryCode countryCode, List<BIMItemsGroup> items)
Parameters
countryCode CountryCode
items List<BIMItemsGroup>
Returns
List<ModelBIM>
 IsDataUpToDate()
public override bool IsDataUpToDate()
Returns
bool
 Select(IEnumerable<Identifier<IIdeaNode>>, IEnumerable<Identifier<IIdeaMember1D>>)
protected abstract void Select(IEnumerable<Identifier<IIdeaNode>> nodes, IEnumerable<Identifier<IIdeaMember1D>> members)
Parameters
nodes IEnumerable<Identifier<IIdeaNode>>
members IEnumerable<Identifier<IIdeaMember1D>>
 Synchronize(CountryCode, List<BIMItemsGroup>)
protected abstract List<ModelBIM> Synchronize(CountryCode countryCode, List<BIMItemsGroup> items)
Parameters
countryCode CountryCode
items List<BIMItemsGroup>
Returns
List<ModelBIM>
 Edit this page